{
  "Abridger": {
    "code": "abr",
    "description": "A person, family, or organization contributing to a resource by shortening or condensing the original work but leaving the nature and content of the original work substantially unchanged. For substantial modifications that result in the creation of a new work, see author"
  },
  "Adapter": {
    "code": "adp",
    "description": "A person or organization who 1) reworks a musical composition, usually for a different medium, or 2) rewrites novels or stories for motion pictures or other audiovisual medium."
  },
  "Author": {
    "code": "aut",
    "description": "A person, family, or organization responsible for creating a work that is primarily textual in content, regardless of media type (e.g., printed text, spoken word, electronic text, tactile text) or genre (e.g., poems, novels, screenplays, blogs). Use also for persons, etc., creating a new work by paraphrasing, rewriting, or adapting works by another creator such that the modification has substantially changed the nature and content of the original or changed the medium of expression"
  },
  "BookDesigner": {
    "code": "bkd",
    "description": "A person or organization involved in manufacturing a manifestation by being responsible for the entire graphic design of a book, including arrangement of type and illustration, choice of materials, and process used"
  },
  "BookProducer": {
    "code": "bkp",
    "description": "A person or organization responsible for the production of books and other print media"
  },
  "BookjacketDesigner": {
    "code": "bjd",
    "description": "A person or organization responsible for the design of flexible covers designed for or published with a book, including the type of materials used, and any decorative aspects of the bookjacket"
  },
  "BookplateDesigner": {
    "code": "bpd",
    "description": "A person or organization responsible for the design of a book owner's identification label that is most commonly pasted to the inside front cover of a book"
  },
  "Bookseller": {
    "code": "bsl",
    "description": "A person or organization who makes books and other bibliographic materials available for purchase. Interest in the materials is primarily lucrative"
  },
  "Contributor": {
    "code": "ctb",
    "description": "A person, family or organization responsible for making contributions to the resource. This includes those whose work has been contributed to a larger work, such as an anthology, serial publication, or other compilation of individual works. If a more specific role is available, prefer that, e.g. editor, compiler, illustrator"
  },
  "Collaborator": "Contributor",
  "CopyrightClaimant": {
    "code": "cpc",
    "description": "A person or organization listed as a copyright owner at the time of registration. Copyright can be granted or later transferred to another person or organization, at which time the claimant becomes the copyright holder"
  },
  "CopyrightHorder": {
    "code": "cph",
    "description": "A person or organization to whom copy and legal rights have been granted or transferred for the intellectual content of a work. The copyright holder, although not necessarily the creator of the work, usually has the exclusive right to benefit financially from the sale and use of the work to which the associated copyright protection applies"
  },
  "Corrector": {
    "code": "crr",
    "description": ""
  },
  "CoverDesigner": {
    "code": "cov",
    "description": "A person or organization responsible for the graphic design of a book cover, album cover, slipcase, box, container, etc. For a person or organization responsible for the graphic design of an entire book, use Book designer; for book jackets, use Bookjacket designer"
  },
  "Creator": {
    "code": "cre",
    "description": "A person or organization responsible for the intellectual or artistic content of a resource"
  },
  "DesignerOfBookjacket": "BookjacketDesigner",
  "DesignerOfCover": "CoverDesigner",
  "DesignerOfBook": "BookDesigner",
  "DesignerOfEbook": "BookDesigner",
  "Editor": {
    "code": "edt",
    "description": "A person, family, or organization contributing to a resource by revising or elucidating the content, e.g., adding an introduction, notes, or other critical matter. An editor may also prepare a resource for production, publication, or distribution. For major revisions, adaptations, etc., that substantially change the nature and content of the original work, resulting in a new work, see author"
  },
  "EditorOfCompilation": {
    "code": "edc",
    "description": "A person, family, or organization contributing to a collective or aggregate work by selecting and putting together works, or parts of works, by one or more creators. For compilations of data, information, etc., that result in new works, see compiler"
  },
  "Illuminator": {
    "code": "ilu",
    "description": "A person providing decoration to a specific item using precious metals or color, often with elaborate designs and motifs"
  },
  "Illustrator": {
    "code": "ill",
    "description": "A person, family, or organization contributing to a resource by supplementing the primary content with drawings, diagrams, photographs, etc. If the work is primarily the artistic content created by this entity, use artist or photographer"
  },
  "Inscriber": {
    "code": "ins",
    "description": "A person who has written a statement of dedication or gift"
  },
  "JointAuthor": "Author",
  "Other": {
    "code": "oth",
    "description": "A role that has no equivalent in the MARC list."
  },
  "PerformerOfResearch": "Researcher",
  "ProducerOfBook": "BookProducer",
  "Proofreader": {
    "code": "pfr",
    "description": "A person who corrects printed matter. For manuscripts, use Corrector [crr]"
  },
  "PublicationPlace": {
    "code": "pup",
    "description": "The place where a resource is published"
  },
  "Publisher": {
    "code": "pbl",
    "description": "A person or organization responsible for publishing, releasing, or issuing a resource"
  },
  "Researcher": {
    "code": "res",
    "description": "A person or organization responsible for performing research"
  },
  "Reviewer": {
    "code": "rev",
    "description": "A person or organization responsible for the review of a book, motion picture, performance, etc."
  },
  "Setting": {
    "code": "stg",
    "description": "An entity in which the activity or plot of a work takes place, e.g. a geographic place, a time period, a building, an event"
  },
  "WriterOfIntroduction": {
    "code": "win",
    "description": "A person, family, or organization contributing to a resource by providing an introduction to the original work"
  },
  "WriterOfPreface": {
    "code": "wpr",
    "description": "A person, family, or organization contributing to a resource by providing a preface to the original work"
  }
}
